In [128]:
import pandas as pd
import numpy as np

In [2]:
s = pd.Series(['1','2000',3000])

In [3]:
print(s)

0       1
1    2000
2    3000
dtype: object

In [4]:
s1 = pd.to_numeric(s) #We use to_numeric to convert data to numeric or float format

In [5]:
print(s1)

0       1
1    2000
2    3000
dtype: int64

In [6]:
s2 = pd.Series(['1.0','#APPLE', 2000, 'Hello'])

In [7]:
s2

0       1.0
1    #APPLE
2      2000
3     Hello
dtype: object

In [8]:
pd.to_numeric(s2) #ignore argument

ValueError: Unable to parse string "#APPLE" at position 1

In [9]:
a = pd.to_numeric(s2, errors = 'coerce')
#Coerce is used to convert any unconvertable format into null values

In [10]:
print(a)

0       1.0
1       NaN
2    2000.0
3       NaN
dtype: float64

In [11]:
de = {'training':['DA','ML','DL','AI',np.nan], 'hours':[np.nan,np.nan,5,6,np.nan], 'tools':[np.nan,np.nan,np.nan,4,np.nan]}

In [13]:
df1 = pd.DataFrame(de)

In [14]:
print(df1)

  training  hours  tools
0       DA    NaN    NaN
1       ML    NaN    NaN
2       DL    5.0    NaN
3       AI    6.0    4.0
4      NaN    NaN    NaN

In [15]:
df1.shape

(5, 3)

In [16]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   training  4 non-null      object
 1   hours     2 non-null      float64
 2   tools     1 non-null      float64
dtypes: float64(2), object(1)
memory usage: 248.0+ bytes

In [37]:
df1.isnull().sum()

training    1
hours       3
tools       4
dtype: int64

In [23]:
df1

  training  hours  tools
0       DA    NaN    NaN
1       ML    NaN    NaN
2       DL    5.0    NaN
3       AI    6.0    4.0
4      NaN    NaN    NaN

In [24]:
#handling null values
df1.dropna(axis=0) #By using dropna we are able to drop entire row which contains the null value

  training  hours  tools
3       AI    6.0    4.0

In [25]:
df1.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4]

In [26]:
df1

  training  hours  tools
0       DA    NaN    NaN
1       ML    NaN    NaN
2       DL    5.0    NaN
3       AI    6.0    4.0
4      NaN    NaN    NaN

In [27]:
df1.dropna(axis=1) #by using axis=1 we are able to drop entire column

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4]

In [28]:
df1.dropna(subset = ['hours'])

  training  hours  tools
2       DL    5.0    NaN
3       AI    6.0    4.0

In [29]:
df1

  training  hours  tools
0       DA    NaN    NaN
1       ML    NaN    NaN
2       DL    5.0    NaN
3       AI    6.0    4.0
4      NaN    NaN    NaN

In [39]:
df1.dropna(thresh =1)

  training  hours  tools
0       DA    NaN    NaN
1       ML    NaN    NaN
2       DL    5.0    NaN
3       AI    6.0    4.0

#### df

In [40]:
#Filling the null values
df1.fillna(100)

  training  hours  tools
0       DA  100.0  100.0
1       ML  100.0  100.0
2       DL    5.0  100.0
3       AI    6.0    4.0
4      100  100.0  100.0

In [41]:
df1

  training  hours  tools
0       DA    NaN    NaN
1       ML    NaN    NaN
2       DL    5.0    NaN
3       AI    6.0    4.0
4      NaN    NaN    NaN

In [42]:
df1.fillna(df1.mean())

<ipython-input-42-5edcc97ecdcb>:1: FutureWarning: The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  df1.fillna(df1.mean())

  training  hours  tools
0       DA    5.5    4.0
1       ML    5.5    4.0
2       DL    5.0    4.0
3       AI    6.0    4.0
4      NaN    5.5    4.0

In [43]:
df1.replace(4, 'four')

  training  hours tools
0       DA    NaN   NaN
1       ML    NaN   NaN
2       DL    5.0   NaN
3       AI    6.0  four
4      NaN    NaN   NaN

In [44]:
df1.replace([5,6], '12#WhEREisMyAssignMent??')

  training                     hours  tools
0       DA                       NaN    NaN
1       ML                       NaN    NaN
2       DL  12#WhEREisMyAssignMent??    NaN
3       AI  12#WhEREisMyAssignMent??    4.0
4      NaN                       NaN    NaN

In [46]:
df1

  training  hours  tools
0       DA    NaN    NaN
1       ML    NaN    NaN
2       DL    5.0    NaN
3       AI    6.0    4.0
4      NaN    NaN    NaN

In [47]:
df1.replace([5,6],[222, 442])

  training  hours  tools
0       DA    NaN    NaN
1       ML    NaN    NaN
2       DL  222.0    NaN
3       AI  442.0    4.0
4      NaN    NaN    NaN

In [48]:
df1.iloc[1,2] = '1@&34EsRj2'

In [49]:
df1.iloc[2,2] = 'h&!}+1FRe3'

In [50]:
df1

  training  hours       tools
0       DA    NaN         NaN
1       ML    NaN  1@&34EsRj2
2       DL    5.0  h&!}+1FRe3
3       AI    6.0         4.0
4      NaN    NaN         NaN

In [51]:
#Simple Assignment, Work on Different Regex Pattern
df1.replace(regex = True, to_replace = '[^0-9]', value = '')

  training  hours tools
0             NaN   NaN
1             NaN  1342
2             5.0    13
3             6.0   4.0
4      NaN    NaN   NaN

In [52]:
df1

  training  hours       tools
0       DA    NaN         NaN
1       ML    NaN  1@&34EsRj2
2       DL    5.0  h&!}+1FRe3
3       AI    6.0         4.0
4      NaN    NaN         NaN

In [53]:
df1.iloc[:,1:3] = df1.iloc[:,1:3].replace(regex= True, to_replace = '[^0-9]', value = '')

In [54]:
df1.iloc[:,1:3]

   hours tools
0    NaN   NaN
1    NaN  1342
2    5.0    13
3    6.0   4.0
4    NaN   NaN

In [55]:
df1

  training  hours tools
0       DA    NaN   NaN
1       ML    NaN  1342
2       DL    5.0    13
3       AI    6.0   4.0
4      NaN    NaN   NaN

In [72]:
heart = pd.read_csv('clevelanda.csv')

In [73]:
heart.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 303 entries, 0 to 302
Data columns (total 14 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   age       303 non-null    int64
 1   gender    303 non-null    int64
 2   cp        303 non-null    int64
 3   trestbps  303 non-null    int64
 4   chol      303 non-null    int64
 5   fps       303 non-null    int64
 6   restecg   303 non-null    int64
 7   thalach   303 non-null    int64
 8   exang     303 non-null    int64
 9   oldpeak   303 non-null    float64
 10  slope     303 non-null    int64
 11  ca        303 non-null    object
 12  thal      303 non-null    object
 13  class     303 non-null    int64
dtypes: float64(1), int64(11), object(2)
memory usage: 33.3+ KB

In [74]:
heart_copy = heart.copy()

In [75]:
heart.tail()

,age,gender,cp,trestbps,chol,fps,restecg,thalach,exang,oldpeak,slope,ca,thal,class
298,45,1,1,110,264,0,0,132,0,1.2,2,0,7,1
299,68,1,4,144,193,1,0,141,0,3.4,2,2,7,2
300,57,1,4,130,131,0,0,115,1,1.2,2,1,7,3
301,57,0,2,130,236,0,2,174,0,0.0,2,1,3,1
302,38,1,3,138,175,0,0,173,0,0.0,1,?,3,0

In [76]:
heart = heart.replace('?', np.nan)

In [77]:
heart.isnull().sum()

age         0
gender      0
cp          0
trestbps    0
chol        0
fps         0
restecg     0
thalach     0
exang       0
oldpeak     0
slope       0
ca          4
thal        2
class       0
dtype: int64

In [78]:
#Incase if we need to fill it?
heart['ca'].value_counts()

0    176
1     65
2     38
3     20
Name: ca, dtype: int64

In [79]:
heart = heart.dropna()

In [80]:
heart.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 303 entries, 0 to 302
Data columns (total 14 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   age       303 non-null    int64
 1   gender    303 non-null    int64
 2   cp        303 non-null    int64
 3   trestbps  303 non-null    int64
 4   chol      303 non-null    int64
 5   fps       303 non-null    int64
 6   restecg   303 non-null    int64
 7   thalach   303 non-null    int64
 8   exang     303 non-null    int64
 9   oldpeak   303 non-null    float64
 10  slope     303 non-null    int64
 11  ca        299 non-null    object
 12  thal      301 non-null    object
 13  class     303 non-null    int64
dtypes: float64(1), int64(11), object(2)
memory usage: 33.3+ KB

In [81]:
heart['ca'] = pd.to_numeric(heart['ca'])

In [82]:
heart['thal'].value_counts()

3    166
7    117
6     18
Name: thal, dtype: int64

In [83]:
heart['thal'] = pd.to_numeric(heart['thal'])

In [84]:
heart.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 303 entries, 0 to 302
Data columns (total 14 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   age       303 non-null    int64
 1   gender    303 non-null    int64
 2   cp        303 non-null    int64
 3   trestbps  303 non-null    int64
 4   chol      303 non-null    int64
 5   fps       303 non-null    int64
 6   restecg   303 non-null    int64
 7   thalach   303 non-null    int64
 8   exang     303 non-null    int64
 9   oldpeak   303 non-null    float64
 10  slope     303 non-null    int64
 11  ca        299 non-null    float64
 12  thal      301 non-null    float64
 13  class     303 non-null    int64
dtypes: float64(3), int64(11)
memory usage: 33.3 KB

In [85]:
heart.tail()

,age,gender,cp,trestbps,chol,fps,restecg,thalach,exang,oldpeak,slope,ca,thal,class
298,45,1,1,110,264,0,0,132,0,1.2,2,0.0,7.0,1
299,68,1,4,144,193,1,0,141,0,3.4,2,2.0,7.0,2
300,57,1,4,130,131,0,0,115,1,1.2,2,1.0,7.0,3
301,57,0,2,130,236,0,2,174,0,0.0,2,1.0,3.0,1
302,38,1,3,138,175,0,0,173,0,0.0,1,NaN,3.0,0

In [69]:
lend = pd.read_excel('Lending Data.xlsx')

C:\Users\shubh\anaconda3\lib\site-packages\openpyxl\worksheet\header_footer.py:48: UserWarning: Cannot parse header or footer so it will be ignored
  warn("""Cannot parse header or footer so it will be ignored""")

In [86]:
lend.head(2)
#1. Drop all the null values
#2. Replace '-' value with column mean
#3. Encode Lender asset size into 0,1,2
#4. Replace '.' with column mean

,Name of Lending Institution,HQ State,Rank,TA Ratio1,TBL Ratio1,"Amount ($1,000)",Number,Lender Asset Size,"Amount ($1,000).1",Number .1,Unnamed: 10,"Amount ($1,000).2",Number .2,CC Amount/TA1
0,NaN,NaN,-1,-2,-3,-4,-5,-6,-7.0,-8.0,NaN,-9.0,-10.0,-11
1,American Express Co.,NY,1,0.23829,0.999544,16350038,3603226,>$50B,16318089.0,3603088.0,NaN,31949.0,138.0,0.28

In [87]:
df = df1

In [88]:
df

  training  hours tools
0       DA    NaN   NaN
1       ML    NaN  1342
2       DL    5.0    13
3       AI    6.0   4.0
4      NaN    NaN   NaN

In [89]:
df1

  training  hours tools
0       DA    NaN   NaN
1       ML    NaN  1342
2       DL    5.0    13
3       AI    6.0   4.0
4      NaN    NaN   NaN

In [90]:
#Joining
a = df.append(df1) #To perform row wise joining
print(a.shape)
print(a)

(10, 3)
  training  hours tools
0       DA    NaN   NaN
1       ML    NaN  1342
2       DL    5.0    13
3       AI    6.0   4.0
4      NaN    NaN   NaN
0       DA    NaN   NaN
1       ML    NaN  1342
2       DL    5.0    13
3       AI    6.0   4.0
4      NaN    NaN   NaN

<ipython-input-90-676ac1e8720d>:2: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  a = df.append(df1) #To perform row wise joining

In [91]:
pd.concat([df, df1], axis = 1)

  training  hours tools training  hours tools
0       DA    NaN   NaN       DA    NaN   NaN
1       ML    NaN  1342       ML    NaN  1342
2       DL    5.0    13       DL    5.0    13
3       AI    6.0   4.0       AI    6.0   4.0
4      NaN    NaN   NaN      NaN    NaN   NaN

In [ ]:
a

In [92]:
df

  training  hours tools
0       DA    NaN   NaN
1       ML    NaN  1342
2       DL    5.0    13
3       AI    6.0   4.0
4      NaN    NaN   NaN

In [93]:
df1

  training  hours tools
0       DA    NaN   NaN
1       ML    NaN  1342
2       DL    5.0    13
3       AI    6.0   4.0
4      NaN    NaN   NaN

In [94]:
pd.merge(df,df1, how = 'right', on = 'training')

  training  hours_x tools_x  hours_y tools_y
0       DA      NaN     NaN      NaN     NaN
1       ML      NaN    1342      NaN    1342
2       DL      5.0      13      5.0      13
3       AI      6.0     4.0      6.0     4.0
4      NaN      NaN     NaN      NaN     NaN

In [95]:
pd.merge(df,df1, how = 'left', on = 'training')

  training  hours_x tools_x  hours_y tools_y
0       DA      NaN     NaN      NaN     NaN
1       ML      NaN    1342      NaN    1342
2       DL      5.0      13      5.0      13
3       AI      6.0     4.0      6.0     4.0
4      NaN      NaN     NaN      NaN     NaN

In [96]:
pd.merge(df,df1, how = 'inner', on = 'training')

  training  hours_x tools_x  hours_y tools_y
0       DA      NaN     NaN      NaN     NaN
1       ML      NaN    1342      NaN    1342
2       DL      5.0      13      5.0      13
3       AI      6.0     4.0      6.0     4.0
4      NaN      NaN     NaN      NaN     NaN

In [98]:
s = pd.Series([1,2,3,2,3,4])

In [99]:
s.replace(2, method ='bfill')

0    1
1    3
2    3
3    3
4    3
5    4
dtype: int64

In [100]:
s.replace(2, method ='ffill')

0    1
1    1
2    3
3    3
4    3
5    4
dtype: int64

In [101]:
df1.columns

Index(['training', 'hours', 'tools'], dtype='object')

In [102]:
df1.drop(df1.columns[2], axis = 1)

  training  hours
0       DA    NaN
1       ML    NaN
2       DL    5.0
3       AI    6.0
4      NaN    NaN

In [103]:
df1.astype(int)

IntCastingNaNError: Cannot convert non-finite values (NA or inf) to integer

In [104]:
df1

  training  hours tools
0       DA    NaN   NaN
1       ML    NaN  1342
2       DL    5.0    13
3       AI    6.0   4.0
4      NaN    NaN   NaN

In [105]:
a = pd.melt(df1)

In [106]:
a

    variable value
0   training    DA
1   training    ML
2   training    DL
3   training    AI
4   training   NaN
5      hours   NaN
6      hours   NaN
7      hours   5.0
8      hours   6.0
9      hours   NaN
10     tools   NaN
11     tools  1342
12     tools    13
13     tools   4.0
14     tools   NaN

In [ ]:
pd.melt(df1)

In [107]:
#df['training']
#or
df.training

0     DA
1     ML
2     DL
3     AI
4    NaN
Name: training, dtype: object

In [ ]:
df

In [108]:
df1 = df1[:2]

In [109]:
df1

  training  hours tools
0       DA    NaN   NaN
1       ML    NaN  1342

In [111]:
df1.training

0    DA
1    ML
Name: training, dtype: object

In [112]:
df1.training

0    DA
1    ML
Name: training, dtype: object

In [113]:
df

  training  hours tools
0       DA    NaN   NaN
1       ML    NaN  1342
2       DL    5.0    13
3       AI    6.0   4.0
4      NaN    NaN   NaN

In [114]:
df[df.training.isin(df1.training)]

  training  hours tools
0       DA    NaN   NaN
1       ML    NaN  1342

In [115]:
df.training.isin(df1.training)

0     True
1     True
2    False
3    False
4    False
Name: training, dtype: bool

In [116]:
df1

  training  hours tools
0       DA    NaN   NaN
1       ML    NaN  1342

In [117]:
a = df.training.isin(df1.training)

In [118]:
df

  training  hours tools
0       DA    NaN   NaN
1       ML    NaN  1342
2       DL    5.0    13
3       AI    6.0   4.0
4      NaN    NaN   NaN

In [119]:
df[df['hours'] < 6] # Rows where the column col is greater than 0.5

  training  hours tools
2       DL    5.0    13

In [120]:

df.sort_values(['hours','tools'],ascending=[True,False]) # Sort values by col1 in ascending order then col2 in descending order

  training  hours tools
2       DL    5.0    13
3       AI    6.0   4.0
1       ML    NaN  1342
0       DA    NaN   NaN
4      NaN    NaN   NaN

In [121]:
df.sort_values(col2,ascending=False) # Sort values by col2 in descending order

NameError: name 'col2' is not defined

In [122]:
df[(df['hours'] > 4) | (df['hours'] < 6)] # Rows where 0.7 > col > 0.5

  training  hours tools
2       DL    5.0    13
3       AI    6.0   4.0

In [123]:
df.sort_values('hours') # Sort values by col1 in ascending order

  training  hours tools
2       DL    5.0    13
3       AI    6.0   4.0
0       DA    NaN   NaN
1       ML    NaN  1342
4      NaN    NaN   NaN

In [124]:
lend.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 97 entries, 0 to 96
Data columns (total 14 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   Name of Lending Institution  96 non-null     object
 1   HQ State                     93 non-null     object
 2   Rank                         94 non-null     object
 3   TA Ratio1                    94 non-null     object
 4   TBL Ratio1                   94 non-null     object
 5   Amount ($1,000)              94 non-null     object
 6   Number                       94 non-null     object
 7   Lender Asset Size            94 non-null     object
 8   Amount ($1,000).1            94 non-null     float64
 9   Number .1                    94 non-null     float64
 10  Unnamed: 10                  0 non-null      float64
 11  Amount ($1,000).2            94 non-null     float64
 12  Number .2                    94 non-null     float64
 13  CC Amount/TA1                94 non-null     object
dtypes: float64(5), object(9)
memory usage: 10.7+ KB

In [125]:
lend.shape

(97, 14)

In [126]:
lend.isnull().sum()

Name of Lending Institution     1
HQ State                        4
Rank                            3
TA Ratio1                       3
TBL Ratio1                      3
Amount ($1,000)                 3
Number                          3
Lender Asset Size               3
Amount ($1,000).1               3
Number .1                       3
Unnamed: 10                    97
Amount ($1,000).2               3
Number .2                       3
CC Amount/TA1                   3
dtype: int64

In [ ]:
lend

In [ ]:
#1. Remove Null Values
#2. Replace '-' values with column mean
#3. Encode >$10B e.t.c. to 0,1,2
#4. Make sure data types are proper
#5. Replace NR with '0'

In [127]:
lend['Lender Asset Size'].unique()

array([-6, '>$50B               ', '$10B-$50B           ',
       '>$10B               ', nan], dtype=object)